{
  "updates": [
    {
      "date": "2025-08-14",
      "major": [],
      "minor": [
        "UI/UX adjustments to the side menu and category menu.",
        "Improved MEO's response generation for more engaging conversations."
      ],
      "bugfixes": [],
      "upcoming": []
    },
    {
      "date": "2025-08-13",
      "major": [],
      "minor": [
        "Adjustments and improvements to the virtual assistant, Meo's functionality."
      ],
      "bugfixes": [],
      "upcoming": []
    },
    {
      "date": "2025-08-08",
      "major": [
        "Made some improvements to the virtual assistant's dialogue management.",
        "Added voice recognition capabilities to the virtual assistant."
      ],
      "minor": [
        "Made some changes to the UI/UX of the virtual assistant."
      ],
      "bugfixes": [],
      "upcoming": []
    },
    {
      "date": "2025-07-28",
      "major": [
        "We're Introducing Meo a virtual assistant to the site! Meo is designed to assist and engage users with personalized conversations, providing a unique interactive experience."
      ],
      "minor": [
        "Various UI/UX improvements and refinements to enhance the overall user experience."
      ],
      "bugfixes": [],
      "upcoming": []
    },
    {
      "date": "2025-07-21",
      "major": [],
      "minor": [],
      "bugfixes": [],
      "upcoming": [
        "Refined profiles and full detailed information for the following new characters will be available soon: Evany, Arzhel, Shelain, Molag, Zenyx, Evalete, Zackcry, Jazen, and Zenki."
      ]
    },
    {
      "date": "2025-06-21",
      "major": [],
      "minor": [
        "Refined the UI of the character panel and improved character information display."
      ],
      "bugfixes": [],
      "upcoming": [
        "New character (\"Ren\", \"Blessica\") will be added to the character selection."
      ]
    },
    {
      "date": "2025-06-10",
      "major": [
        "Enhanced character selection logic for improved usability and performance.",
        "Applied the specific character's accent color to both the character selection panel overlay and the info panel for visual consistency.",
        "Added active state indication for filter role buttons when selected."
      ],
      "minor": [
        "Refined the profile layout and styling on the settings menu."
      ],
      "bugfixes": [],
      "upcoming": [
        "Refined character informations.",
        "New character \"Blessica\" will be added to the character selection."
      ]
    },
    {
      "date": "2025-06-09",
      "major": [],
      "minor": [
        "Overall UI/UX design adjustments.",
        "Adjustments and refinements to the white theme related colors.",
        "Refined popup UI and UX for a more cohesive and intuitive experience.",
        "Standardized rounded corners and visual styles across all popups for improved consistency.",
        "Enhanced popup animations for smoother transitions and ensured consistent use of blur overlays.",
        "Improved character selection UI with additional adjustments and refinements."
      ],
      "bugfixes": [],
      "upcoming": []
    },
    {
      "date": "2025-05-29",
      "major": [
        "Enhanced character selection logic with new features: toggle hide/show for character selection and information, minimize/maximize character selection panel, and improved display of character information.",
        "Added enhanced accent color selection functionality, for a specific character."
      ],
      "minor": [
        "Made some adjustments to the character selection logic.",
        "Improved the character filter functionality.",
        "Added smooth transition to the hide and show functionality of the character selection."
      ],
      "bugfixes": [],
      "upcoming": []
    },
    {
      "date": "2025-05-23",
      "major": [
        "Optimized carousel functionality for smoother transitions and performance.",
        "Improved character selection logic for better responsiveness, accuracy.",
        "Character filter is now fully functional. Further enhancements are planned.",
        "Streamlined commission sheet filter for enhanced usability.",
        "Refined contact form interactions and validation logic.",
        "Enhanced navigation logic for a more intuitive user experience.",
        "Polished popup behavior to ensure consistent display and performance.",
        "Optimized portfolio filtering for faster and more accurate results.",
        "Improved search functionality for better relevance and speed.",
        "Streamlined slideshow transitions and control logic.",
        "Refined theme selection and multilingual translation handling."
      ],
      "minor": [
        "Overall UI/UX design adjustments."
      ],
      "bugfixes": [
        "Fixed some bugs."
      ],
      "upcoming": []
    }
  ]
}
