{
  "updates": [

    {
      "date": "10/2/2024",
      "major": [
        "Resolved the issue with the welcome popup icon not appearing on certain pages."
      ],
      "minor": [
        "Made general minor adjustments."
      ],
      "bugfixes": [
        
      ],
      "upcoming": [
        "Introduction of a Character page (coming soon).",
        "Addition of Comic chapters (coming soon).",
        "Commissioner info page (coming soon).",
        "Timelapse video page (coming soon).",
        "Personal project page (coming soon)."
      ]
    },    

    {
      "date": "10/1/2024",
      "major": [
        "Added a cookie popup to improve user experience and compliance.",
        "Refined and optimized the code for popup functionality.",
        "Resolved an issue with the dropdown's hidden behavior on mobile, removing the distracting line on the left.",
        "Fixed visibility issues with the favicon and avatar.",
        "Redesigned the 'What's New' button logic to toggle the popup with a single click, removing the need for a separate close button.",
        "Updated meta tags for better SEO and sharing optimization."
      ],
      "minor": [
        "Removed the blur effect from the homepage slideshow for improved performance.",
        "Added an animation to the 'What's New' button for a more dynamic user interaction.",
        "Optimized media assets, including images and logos, for faster loading.",
        "Updated the logo with a sleek, modern design."
      ],
      "bugfixes": [
        "Cleaned up unused code and reorganized it for better performance."
      ],
      "upcoming": [
        "Introduction of a Character page (coming soon).",
        "Addition of Comic chapters (coming soon).",
        "Commissioner info page (coming soon).",
        "Timelapse video page (coming soon).",
        "Personal project page (coming soon)."
      ]
    },    

    {
      "date": "09/30/2024",
      "major": [
        "Added the 'What's New' section on the homepage for updates.",
        "Added a currency converter to the commission sheet page.",
        "Improved the contact form by replacing the old free API FormSubmit with Web3Forms."
      ],
      "minor": [
        "Made several changes and adjustments to the commission sheet information and pricing.",
        "Enhanced the overall interface and refined the main theme.",
        "Updated the second theme, which now toggles to a white design."
      ],
      "bugfixes": [
        "Streamlined code for improved performance and applied various fixes."
      ],
      "upcoming": [
        "Introduction of a Character page (coming soon).",
        "Comic chapters (coming soon).",
        "Commissioner info page (coming soon).",
        "Timelapse video page (coming soon).",
        "Personal project page (coming soon)."
      ]
    }
  ]
}
